khttang/esp32-biometric-system/firmware/sdkconfig.defaults
# =============================================================================
# 1. Core Operating System & Task Stacks
# =============================================================================
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_FREERTOS_IDLE_TASK_STACKSIZE=4096
CONFIG_PTHREAD_TASK_STACK_SIZE_DEFAULT=4096

# Extended Watchdog Timeout for DSI Bridge / Camera Bring-up
CONFIG_ESP_TASK_WDT_TIMEOUT_S=15

# =============================================================================
# 2. ESP32-P4 Target Directives
# =============================================================================
CONFIG_IDF_TARGET="esp32p4"
CONFIG_IDF_TARGET_ESP32P4=y

# =============================================================================
# 3. External RAM (PSRAM) Configuration (32MB @ 200MHz)
# =============================================================================
CONFIG_SPIRAM=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768

# =============================================================================
# 4. Flash & Partition Table Configuration (16MB)
# =============================================================================
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_PARTITION_TABLE_OFFSET=0xc000

# =============================================================================
# 5. Processor L2 Cache Boost (ESP-DL Neural Engine Acceleration)
# =============================================================================
CONFIG_CACHE_L2_CACHE_128KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

# =============================================================================
# 6. Peripheral Drivers & Compiler Features
# =============================================================================
# C++ Compiler Configuration (Required for ESP-DL & biometrics_wrapper try/catch)
CONFIG_COMPILER_CXX_EXCEPTIONS=y
CONFIG_COMPILER_CXX_RTTI=y

# ESP-DL Neural Engine & ESP-WHO Support
CONFIG_ESP_DL_MULTICORE=y
CONFIG_ESP_DL_SUPPORT=y
CONFIG_ESP_WHO_SUPPORT=y

# Camera Controller & ISP Drivers
CONFIG_ESP_DRIVER_CAM_CSI_ENABLE=y
CONFIG_ESP_DRIVER_ISP_ENABLE=y

# RMII EMAC Ethernet Driver (ESP32-P4)
CONFIG_ETH_ENABLED=y
CONFIG_ETH_USE_ESP32P4_EMAC=y
CONFIG_ETH_PHY_INTERFACE_RMII=y
CONFIG_ETH_RMII_CLK_INPUT=y

# Power Management
CONFIG_PM_ENABLE=y
CONFIG_PM_DFS_INIT_AUTO=n
CONFIG_PM_PROFILING=n

# =============================================================================
# 7. Waveshare ESP32-P4-NANO BSP & Display Configuration
# =============================================================================
# Master MIPI DSI Enable
CONFIG_LCD_ENABLE_MIPI_DSI_PANEL=y

# 5.0-inch DSI Panel Selection & Timing
CONFIG_BSP_LCD_TYPE_720_1280_5_INCH_A=y
CONFIG_BSP_LCD_MIPI_DSI_LANE_BITRATE_MBPS=500

# Color Format & PSRAM Double Buffering
CONFIG_BSP_LCD_COLOR_FORMAT_RGB565=y
CONFIG_BSP_LCD_DPI_BUFFER_NUMS=2

# Waveshare BSP I2C Master Bus (GPIO 7 SDA / GPIO 8 SCL)
CONFIG_BSP_I2C_NUM=0
CONFIG_BSP_I2C_SDA=7
CONFIG_BSP_I2C_SCL=8
CONFIG_BSP_I2C_FAST_MODE=y
CONFIG_BSP_I2C_CLK_SPEED_HZ=400000
CONFIG_I2C_ENABLE_SLAVE=n

# Audio, Storage & Mount Points
CONFIG_BSP_I2S_NUM=0
CONFIG_BSP_SD_MOUNT_POINT="/sdcard"
CONFIG_BSP_SPIFFS_MOUNT_POINT="/spiffs"
CONFIG_BSP_SPIFFS_PARTITION_LABEL="storage"
CONFIG_BSP_SPIFFS_MAX_FILES=5